DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
/***********************************************************
* The DIY Flow Bench project
* https://diyflowbench.com
* 
* Sensors.cpp - Sensors class
*
* Open source flow bench project to measure and display volumetric air flow using an ESP32 / Arduino.
* 
* For more information please visit the WIKI on our GitHub project page: https://github.com/DeeEmm/DIY-Flow-Bench/wiki
* Or join our support forums: https://github.com/DeeEmm/DIY-Flow-Bench/discussions 
* You can also visit our Facebook community: https://www.facebook.com/groups/diyflowbench/
* 
* This project and all associated files are provided for use under the GNU GPL3 license:
* https://github.com/DeeEmm/DIY-Flow-Bench/blob/master/LICENSE
* 
* NOTE: Methods return sensor values in (SI) standard units. This allows any sensor to be integrated into the system
*
* TODO: Would like to implement PCNT pulse counter for frequency measurement
* https://github.com/DavidAntliff/esp32-freqcount/blob/master/frequency_count.c
***/

#include "Arduino.h"

#include "configuration.h"
#include "constants.h"
#include "pins.h"
#include "structs.h"

#include <Wire.h>
#include "hardware.h"
#include "sensors.h"
#include "messages.h"
#include "driver/pcnt.h"
#include LANGUAGE_FILE

#ifdef MAF_IS_ENABLED
#include MAF_DATA_FILE
#endif

#ifdef ADC_IS_ENABLED
#include <Adafruit_ADS1X15.h>
#endif

#ifdef BME_IS_ENABLED
#include <SFunBME280.h>
//#include "bme280.h"
#endif



Sensors::Sensors() {

}


void Sensors::begin () {

	Messages _message;
	
	_message.serialPrintf("Initialising Sensors \n");
	
	Sensors::initialise ();
	
	_message.serialPrintf("Sensors Initialised \n");

}



// NOTE: Voodoo needed to get interrupt to work within class structure for frequency measurement. 
// We declare a new instance of the Sensor class so that we can use it for the MAF ISR
// https://forum.arduino.cc/t/pointer-to-member-function/365758
Sensors __mafVoodoo;



void Sensors::initialise () {

	Messages _message;
	#ifdef MAF_IS_ENABLED
	MafData _mafdata;
	#endif

	extern struct DeviceStatus status;
    extern struct Translator translate;
	// extern int mafOutputType;

	// _mafdata.begin();
	
	//initialise BME
	#ifdef BME_IS_ENABLED
	
		//BME280 _bme280;
		BME280 _BMESensor;
		
		_message.serialPrintf("Initialising BME280 \n");	
		
		_BMESensor.setMode(0); // Sleep mode - required when writing settings to BME device
		_BMESensor.setReferencePressure(SEALEVELPRESSURE_HPA * 100);
		_BMESensor.setI2CAddress(BME280_I2C_ADDR);
		_BMESensor.beginI2C();
		_BMESensor.setPressureOverSample(16);
		_BMESensor.setHumidityOverSample(4);
		_BMESensor.setTempOverSample(16);
		_BMESensor.setStandbyTime(1);
		_BMESensor.setFilter(16);
		_BMESensor.setMode(2); // Normal
		
		//_bme280.initialise(BME280_I2C_ADDR);
//		//_bme280.setControl(0x11); // 0x11 - Normal Mode
	
	
		// if (!this->BME280init()) {
		// 	_message.statusPrintf("BME280 device Error!! \n");
		// } else {
		// 	_message.statusPrintf("BME280 device initialised \n");		
		// }
	#endif


	// Set up the MAF ISR if required
	// Note Frequency based MAFs are required to be attached direct to MAF pin for pulse counter to work
	// This means 5v > 3.3v signal conditioning is required on MAF pin
/* TODO: temp disabled - need to reenable	
	if (_mafdata.mafOutputType == FREQUENCY) {	
		__mafVoodoo.mafSetupISR(MAF_PIN, []{__mafVoodoo.mafFreqCountISR();}, FALLING);
		timer = timerBegin(0, 2, true);                                  
		timerStart(timer);	
	}
*/	


	// Definitions for system status pane
	// MAF Sensor
	#if defined MAF_IS_ENABLED && MAF_SRC_IS_ADC && ADC_IS_ENABLED
		this->_mafSensorType = _mafdata.mafSensorType;
	#elif defined MAF_IS_ENABLED && defined MAF_SRC_IS_PIN
		this->_mafSensorType = _mafdata.mafSensorType + " on GPIO:" + MAF_PIN;
	#else
		this->_mafSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif

	// Baro Sensor
	#if defined BARO_SENSOR_TYPE_REF_PRESS_AS_BARO
		this->startupBaroPressure = this->getPRefValue();
		this->_baroSensorType = translate.LANG_VAL_START_REF_PRESSURE;
	#elif defined BARO_SENSOR_TYPE_FIXED_VALUE
		this->startupBaroPressure = DEFAULT_BARO_VALUE;
		this->_baroSensorType = translate.LANG_VAL_FIXED_VALUE;
		this->_baroSensorType += DEFAULT_BARO_VALUE;
	#elif defined BARO_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED
		this->_baroSensorType = "BME280";
	#elif defined BARO_SENSOR_TYPE_MPX4115
		this->_baroSensorType = "MPX4115";
	#elif defined BARO_SENSOR_TYPE_LINEAR_ANALOG
		this->_baroSensorType = "ANALOG PIN: " + REF_BARO_PIN;
	#else 
		this->_baroSensorType = translate.LANG_VAL_FIXED_VALUE + DEFAULT_BARO_VALUE;
	#endif
	
	//Temp Sensor
	#ifdef TEMP_SENSOR_NOT_USED
		this->startupBaroPressure = this->getPRefValue();
		this->_tempSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined TEMP_SENSOR_TYPE_FIXED_VALUE
		this->_tempSensorType = translate.LANG_VAL_FIXED_VALUE;
		this->_tempSensorType += DEFAULT_TEMP_VALUE;
	#elif defined TEMP_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED
		this->_tempSensorType = "BME280";
	#elif defined TEMP_SENSOR_TYPE_SIMPLE_TEMP_DHT11
		this->_tempSensorType = "Simple DHT11";
	#elif defined TEMP_SENSOR_TYPE_LINEAR_ANALOG
		this->_tempSensorType = "ANALOG PIN: " + TEMPERATURE_PIN;
	#else 
		this->_tempSensorType = translate.LANG_VAL_FIXED_VALUE + DEFAULT_TEMP_VALUE;
	#endif
	
	// Rel Humidity Sensor
	#ifdef RELH_SENSOR_NOT_USED
		this->startupBaroPressure = this->getPRefValue();
		this->_relhSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined RELH_SENSOR_TYPE_FIXED_VALUE
		this->_relhSensorType = translate.LANG_VAL_FIXED_VALUE;
		this->_relhSensorType += DEFAULT_RELH_VALUE;
	#elif defined RELH_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED
		this->_relhSensorType = "BME280";
	#elif defined RELH_SENSOR_TYPE_SIMPLE_TEMP_DHT11
		this->_relhSensorType = "Simple DHT11";
	#elif defined RELH_SENSOR_TYPE_LINEAR_ANALOG
		this->_relhSensorType = "ANALOG PIN: " + HUMIDITY_PIN;
	#else 
		this->_relhSensorType = translate.LANG_VAL_FIXED_VALUE + DEFAULT_RELH_VALUE;
	#endif

	// reference pressure
	#ifdef PREF_SENSOR_NOT_USED
		this->_prefSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined PREF_SENSOR_TYPE_MPXV7007 && defined ADS_IS_ENABLED
		this->_prefSensorType = "SMPXV7007";
	#elif defined PREF_SENSOR_TYPE_MPX4250 && defined ADS_IS_ENABLED
		this->_prefSensorType = "MPX4250";
	#elif defined PREF_SENSOR_TYPE_LINEAR_ANALOG
		this->_prefSensorType = "ANALOG PIN: " + REF_PRESSURE_PIN;
	#else 
		this->_prefSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif
	
