DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	// differential pressure
	#ifdef PDIFF_SENSOR_NOT_USED
		this->_pdiffSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined PPDIFF_SENSOR_TYPE_MPXV7007 && defined ADS_IS_ENABLED
		this->_pdiffSensorType = "SMPXV7007";
	#elif defined PDIFF_SENSOR_TYPE_LINEAR_ANALOG
		this->_pdiffSensorType = "ANALOG PIN: " + DIFF_PRESSURE_PIN;
	#else 
		this->_pdiffSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif
	
	// pitot pressure differential
    #ifdef PITOT_SENSOR_NOT_USED
		this->_pitotSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined PITOT_SENSOR_TYPE_MPXV7007 && defined ADS_IS_ENABLED
		this->_pitotSensorType = "SMPXV7007";
	#elif defined PITOT_SENSOR_TYPE_LINEAR_ANALOG
		this->_pitotSensorType = "ANALOG PIN: " + PITOT_PIN;
	#else 
		this->_pitotSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif
	
	// Set status values for GUI
	status.mafSensor = this->_mafSensorType;
	status.baroSensor = this->_baroSensorType;
	status.tempSensor = this->_tempSensorType;
	status.relhSensor = this->_relhSensorType;
	status.prefSensor = this->_prefSensorType;
	status.pdiffSensor = this->_pdiffSensorType;
	status.pitotSensor = this->_pitotSensorType;

	// END System status definitions

}


/***********************************************************
 * Set up MAF ISR
 *
 * We cannot call a non-static member function directly so we need to encapsulate it
 * This is part of the Voodoo
 ***/
/* TODO: temp disabled - need to reenable	
void Sensors::mafSetupISR(uint8_t irq_pin, void (*ISR_callback)(void), int value) {
  attachInterrupt(digitalPinToInterrupt(irq_pin), ISR_callback, value);
}
*/



/***********************************************************
* Interrupt Service Routine for MAF Frequency measurement
*
* Determine how long since last triggered (Resides in RAM memory as it is faster)
***/
// TODO: Add IRAM_ATTR to Nova-Arduino 
/* TODO: temp disabled - need to reenable	
void IRAM_ATTR Sensors::mafFreqCountISR() {
    uint64_t TempVal = timerRead(timer);            
    PeriodCount = TempVal - StartValue;             
    StartValue = TempVal;                           
}
*/



/***********************************************************
 * Returns MAF signal in Millivolts
 ***/
double Sensors::getMafMillivolts() {
	
	Hardware _hardware;
	
	#if defined MAF_SRC_IS_ADC && defined ADC_IS_ENABLED
		mafMillivolts = _hardware.getADCMillivolts(MAF_ADC_CHANNEL);
				
	#elif defined MAF_SRC_IS_PIN	
		long mafRaw = analogRead(MAF_PIN);
		mafMillivolts = (mafRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else
		mafMillivolts = 1;
		return 1;
	#endif
	
	// Lets make sure we have a valid value to return
	if (mafMillivolts > 0) {
		mafMillivolts += MAF_MV_TRIMPOT;
		return mafMillivolts;
	} else {
		return 1;
	}	
	
}



/***********************************************************
 * Returns RAW MAF Sensor value
 *
 * MAF decode is done in Calculations.cpp
 ***/
double Sensors::getMafValue() {
	
	Hardware _hardware;
	#ifdef MAF_IS_ENABLED
	MafData _mafdata;
	
	double mafFlow = 0.0;

	switch (_mafdata.mafOutputType) {
		
		case VOLTAGE:
		{
			int mafMillivolts = 0;
			
			#if defined MAF_SRC_IS_ADC && defined ADC_IS_ENABLED
				//mafFlowRaw = _hardware.getADCRawData(MAF_ADC_CHANNEL);
				mafMillivolts = _hardware.getADCMillivolts(MAF_ADC_CHANNEL);
				
			#elif defined MAF_SRC_IS_PIN	
				long mafFlowRaw = analogRead(MAF_PIN);
				mafMillivolts = (mafFlowRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
			#else
				mafMillivolts = 1;
				return 1;
			#endif

			mafFlow = mafMillivolts + MAF_MV_TRIMPOT;			
			return mafFlow;
		}
		break;
		
		case FREQUENCY:
		{  
			// TODO
			mafFlow = 40000000.00 / PeriodCount;
			//mafFlow = 40000000.00 / __mafVoodoo.PeriodCount; // NOTE: Do we need Voodoo?
			mafFlow += MAF_MV_TRIMPOT;
			return mafFlow;
		}
		break;
		
	}	
	
	return mafFlow;

	#endif

	return 1; // MAF is disabled so lets return 1
}




/***********************************************************
 * Returns temperature in Deg C
 ***/
double Sensors::getTempValue() {
	
	Hardware _hardware;
	Messages _message;


	double refTempDegC;
	
	   // extern struct Translator translate;
	
	#ifdef TEMP_SENSOR_TYPE_LINEAR_ANALOG
	
		long rawTempValue = analogRead(TEMPERATURE_PIN);	
		double tempMillivolts = (rawTempValue * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;	
		tempMillivolts += TEMP_MV_TRIMPOT;		
		refTempDegC = tempMillivolts * TEMP_ANALOG_SCALE;
		refTempDegC +=  TEMP_FINE_ADJUST;
		
	#elif defined TEMP_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED

		BME280 _BMESensor;
		
		//refTempDegC = _bme280.getTemperature();
		refTempDegC = _BMESensor.readTempC() / 100.00F;
		refTempDegC +=  TEMP_FINE_ADJUST;

	#elif defined TEMP_SENSOR_TYPE_SIMPLE_TEMP_DHT11
		// NOTE DHT11 sampling rate is max 1HZ. We may need to slow down read rate to every few secs
		int err = SimpleDHTErrSuccess;
		if ((err = dht11.read(&refTemp, &refRelh, NULL)) != SimpleDHTErrSuccess) {
		  _message.Handler(translate.LANG_VAL_DHT11_READ_FAIL); // Set error to display on screen
		  refTempDegC = 0;        
		} else {
		  refTempDegC = refTemp;
		}	
		refTempDegC +=  TEMP_FINE_ADJUST;

	#else
		// We don't have any temperature input so we will assume default
		refTempDegC = DEFAULT_TEMP_VALUE;
	#endif
	
	return refTempDegC;
}



/***********************************************************
* Returns Barometric pressure in kPa
* NOTE: Should we use hPa? (hPa is standard output of BME280)
***/
double Sensors::getBaroValue() {
	
	Hardware _hardware;

		
	#if defined BARO_SENSOR_TYPE_LINEAR_ANALOG
		
		long rawBaroValue = analogRead(REF_BARO_PIN);
		double baroMillivolts = (rawBaroValue * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
		baroMillivolts += BARO_MV_TRIMPOT;		
		baroPressureKpa = baroMillivolts * BARO_ANALOG_SCALE;
		baroPressureKpa += BARO_FINE_ADJUST;
	
	#elif defined BARO_SENSOR_TYPE_MPX4115
		// Datasheet - https://html.alldatasheet.es/html-pdf/5178/MOTOROLA/MPX4115/258/1/MPX4115.html
		// Vout = VS (P x 0.009 – 0.095) --- Where VS = Supply Voltage (Formula from Datasheet)
		baroPressureKpa = map(_hardware.getADCRawData(BARO_ADC_CHANNEL), 0, 4095, 15000, 115000);
		baroPressureKpa += BARO_FINE_ADJUST;

	#elif defined BARO_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED

		BME280 _BMESensor;
			
		// baroPressureKpa = _bme280.getBaro() * 10.0F; 
		baroPressureKpa = _BMESensor.readFloatPressure() * 10.0F; // Convert hPa to kPa
		baroPressureKpa += BARO_FINE_ADJUST;
		
	#elif defined BARO_SENSOR_TYPE_REF_PRESS_AS_BARO
		// No baro sensor defined so use value grabbed at startup from reference pressure sensor
		// NOTE will only work for absolute style pressure sensor like the MPX4250
		baroPressureKpa = startupBaroPressure; 
		baroPressureKpa += BARO_FINE_ADJUST;
	#else
		// we don't have any sensor so use default - // NOTE: standard sea level baro pressure is 14.7 psi
		baroPressureKpa = DEFAULT_BARO_VALUE;
	#endif

	// Truncate to 2 decimal places
	// int value = baroPressureKpa * 100 + .5;
    // return (double)value / 100;

