DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	return baroPressureKpa;

}



/***********************************************************
 * Returns Relative Humidity in %
 ***/
double Sensors::getRelHValue() {
	
	Hardware _hardware;

	  // extern struct Translator translate;
		
	#ifdef RELH_SENSOR_TYPE_LINEAR_ANALOG
	
		long rawRelhValue = analogRead(HUMIDITY_PIN);
		double relhMillivolts = (rawRelhValue * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
		relhMillivolts += RELH_MV_TRIMPOT;		
		relativeHumidity = relhMillivolts * RELH_ANALOG_SCALE;
		relativeHumidity += RELH_FINE_ADJUST;
	
	#elif defined RELH_SENSOR_TYPE_SIMPLE_RELH_DHT11
	
		// NOTE DHT11 sampling rate is max 1HZ. We may need to slow down read rate to every few secs
		int err = SimpleDHTErrSuccess;
		if ((err = dht11.read(&refTemp, &refRelh, NULL)) != SimpleDHTErrSuccess) {
		  _message.Handler(translate.LANG_VAL_DHT11_READ_FAIL); // Set error to display on screen
		  relativeHumidity = 0;        
		} else {
		  relativeHumidity = refRelh;
		}
		relativeHumidity + RELH_FINE_ADJUST;

	#elif defined RELH_SENSOR_TYPE_BME280 && defined BME_IS_ENABLED

		BME280 _BMESensor;
	
		// relativeHumidity = _bme280.getHumidity(); 
		relativeHumidity = _BMESensor.readFloatHumidity() * 10;
		relativeHumidity + RELH_FINE_ADJUST;
		

	#else
		// we don't have a sensor so use nominal fixed value 
		relativeHumidity = DEFAULT_RELH_VALUE; // (36%)
	
	#endif

	return relativeHumidity;
	
}


/***********************************************************
 * Returns altitude based on pressure difference from local sea level
 ***/
double Sensors::getAltitude() {
  // Equation taken from BMP180 datasheet (page 16):
  //  http://www.adafruit.com/datasheets/BST-BMP180-DS000-09.pdf

  // Note that using the equation from wikipedia can give bad results
  // at high altitude. See this thread for more information:
  //  http://forums.adafruit.com/viewtopic.php?f=22&t=58064

  //TODO: BREAK PRESSURE OUT TO CONFIG VALUE THAT CAN BE SET IN GUI
  double atmospheric = getRelHValue() / 100.0F;
  return 44330.0 * (1.0 - pow(atmospheric / SEALEVELPRESSURE_HPA, 0.1903));
}



/***********************************************************
 * getPRefMillivolts
 * Returns Reference pressure in Millivolts
 ***/
double Sensors::getPRefMillivolts() {

	Hardware _hardware;

	#if defined PREF_SRC_ADC && defined ADC_IS_ENABLED
		refPressMillivolts = _hardware.getADCMillivolts(PREF_ADC_CHANNEL);
				
	#elif defined PREF_SRC_PIN	
		long refPressRaw = analogRead(REF_PRESSURE_PIN);
		refPressMillivolts = (refPressRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else	
		refPressMillivolts = 1;
		return 1;
	#endif

	// Lets make sure we have a valid value to return
	if (refPressMillivolts > 0) {
		refPressMillivolts += PREF_MV_TRIMPOT;
		return refPressMillivolts;
	} else {
		return 1;
	}


}

/***********************************************************
 * getPRefValue
 * Returns Reference pressure in kPa
 ***/
double Sensors::getPRefValue() {

	Hardware _hardware;
	Messages _message;
	
	double refPressureKpa = 0.0;
	
	#if defined PREF_SENSOR_TYPE_LINEAR_ANALOG
		refPressureKpa = getPRefMillivolts() * PREF_ANALOG_SCALE;
	
	#elif defined PREF_SENSOR_TYPE_MPXV7007
		// Datasheet - https://www.nxp.com/docs/en/data-sheet/MPXV7007.pdf
		// Vout = VS x (0.057 x P + 0.5) --- Where VS = Supply Voltage (Formula from MPXV7007DP Datasheet)
		// refPressureKpa = ((refPressMillivolts / supplyMillivolts ) - 0.5) / 0.057;  
		
		if (!(Sensors::getPRefMillivolts() > 0) | !(_hardware.get5vSupplyMillivolts() > 0)) return 1; 

		refPressureKpa = (((Sensors::getPRefMillivolts() / _hardware.get5vSupplyMillivolts() ) - 0.5) / 0.057);  

	#else
		// No reference pressure sensor used so lets return a fixed value (so as not to throw maths out)
		// refPressureKpa = 6.97448943333324; //28"
		refPressureKpa = DEFAULT_REF_PRESS_VALUE;

	#endif
	
	return refPressureKpa;

}




/***********************************************************
 * Returns Differential Pressure in Millivolts
 ***/
double Sensors::getPDiffMillivolts() {
	
	Hardware _hardware;
	
	#if defined PDIFF_SRC_IS_ADC && defined ADC_IS_ENABLED
		pDiffMillivolts = _hardware.getADCMillivolts(PDIFF_ADC_CHANNEL);
				
	#elif defined PDIFF_SRC_IS_PIN	
		long pDiffRaw = analogRead(DIFF_PRESSURE_PIN);
		pDiffMillivolts = (pDiffRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else
		pDiffMillivolts = 1;
		return 1;
	#endif
	
	// Lets make sure we have a valid value to return
	if (pDiffMillivolts > 0) {
		pDiffMillivolts += PDIFF_MV_TRIMPOT;
		return pDiffMillivolts;
	} else {
		return 1;
	}
	
}




/***********************************************************
 * Returns Pressure differential in kPa
 ***/
double Sensors::getPDiffValue() {

	Hardware _hardware;
	Messages _message;

	double diffPressureKpa = 0.0;
	int diffPressMillivolts;
	long diffPressRaw;	

	#if defined PDIFF_SRC_IS_ADC && defined ADC_IS_ENABLED
		diffPressMillivolts = getPDiffMillivolts();	
	#elif defined PDIFF_SRC_IS_PIN	
		diffPressRaw = analogRead(DIFF_PRESSURE_PIN);
		diffPressMillivolts = (diffPressRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else
		diffPressMillivolts = 1;
		return 1;
	#endif
	
//_message.serialPrintf("%s \n", diffPressRaw);	
	
	diffPressMillivolts += PDIFF_MV_TRIMPOT;

	#if defined PDIFF_SENSOR_TYPE_LINEAR_ANALOG
		diffPressureKpa = diffPressMillivolts * PDIFF_ANALOG_SCALE;
	
	#elif defined PDIFF_SENSOR_TYPE_MPXV7007
		// RECOMMENDED SENSOR
		// Datasheet - https://www.nxp.com/docs/en/data-sheet/MPXV7007.pdf
		// Vout = VS x (0.057 x P + 0.5) --- Where VS = Supply Voltage (Formula from MPXV7007DP Datasheet)
		
		#if defined ADC_TYPE_ADS1115
			//scale for 16 bit ADC
			if (!(Sensors::getPDiffMillivolts() > 0) | !(_hardware.get5vSupplyMillivolts() > 0)) return 1; 
			
			diffPressureKpa = (((Sensors::getPDiffMillivolts() / _hardware.get5vSupplyMillivolts() ) - 0.5) / 0.057);  
			
			
		#elif defined ADC_TYPE_ADS1015
			//scale for 12 bit ADC
			diffPressureKpa = map(_hardware.getADCRawData(PREF_ADC_CHANNEL), 0, 4095, -7000, 7000); 
		#endif
		
		 
	#elif defined PDIFF_SENSOR_NOT_USED 
	#else
		// No reference pressure sensor used so lets return a value (so as not to throw maths out)
		// refPressureKpa = 6.97448943333324; //28"
		diffPressureKpa = DEFAULT_PDIFF_PRESS;

	#endif

