DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	return diffPressureKpa;

}




/***********************************************************
 * Returns Pitot Pressure in Millivolts
 ***/
double Sensors::getPitotMillivolts() {

	Hardware _hardware;
	
	#if defined PITOT_SRC_IS_ADC && defined ADC_IS_ENABLED
		pitotMillivolts = _hardware.getADCMillivolts(PITOT_ADC_CHANNEL);
	#elif defined PDIFF_SRC_IS_PIN	
		long pitotRaw = analogRead(PITOT_PIN);
		pitotMillivolts = (pitotRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else
		pitotMillivolts = 1;
		return 1;
	#endif
	
	// Lets make sure we have a valid value to return
	if (pitotMillivolts > 0) {
		pitotMillivolts += PITOT_MV_TRIMPOT;
		return pitotMillivolts;
	} else {
		return 1;
	}
	
	
}





/***********************************************************
 * Returns Pitot pressure differential in kPa
 ***/
double Sensors::getPitotValue() {
	
	Hardware _hardware;


	double pitotPressureKpa = 0.0;
 	long pitotPressRaw;
	double pitotMillivolts;
	
	
	#if defined PITOT_SRC_IS_ADC && defined ADC_IS_ENABLED
		pitotMillivolts = getPitotMillivolts();
	#elif defined PITOT_SRC_IS_PIN	
		pitotPressRaw = analogRead(PITOT_PIN);
		pitotMillivolts = (pitotPressRaw * (_hardware.get3v3SupplyMillivolts() / 4095.0)) * 1000;
	#else
		pitotMillivolts = 1;
		return 1;
	#endif
	
//Serial.println(pitotPressRaw);		
	
	pitotMillivolts += PITOT_MV_TRIMPOT;
	
	#if defined PITOT_SENSOR_TYPE_LINEAR_ANALOG
		pitotPressureKpa = pitotMillivolts * PITOT_ANALOG_SCALE;
	
	#elif defined PITOT_SENSOR_TYPE_MPXV7007DP
		
		if (!(Sensors::getPitotMillivolts() > 0) | !(_hardware.get5vSupplyMillivolts() > 0)) return 1; 
		
		pitotPressureKpa = (((Sensors::getPitotMillivolts() / _hardware.get5vSupplyMillivolts() ) - 0.5) / 0.057);  

	#else
		// No pitot probe used so lets return a fixed value
		pitotPressureKpa = DEFAULT_PITOT_VALUE;

	#endif

	return pitotPressureKpa;

}









//DEPRECATED:
/*


// https://github.com/Seeed-Studio/Grove_BME280/blob/master/Seeed_BME280.cpp

bool Sensors::BME280init() {
	
	Messages _message;
	
	uint8_t retry = 0;
	uint8_t chip_id = 0;
	
	// while ((retry++ < 5) && (chip_id != 0x60)) {
	// 	chip_id = Sensors::BME280Read8(BME280_REG_CHIPID);
	// 	_message.statusPrintf("BME280 Read chip ID: %s \n", chip_id);
	// 	delay(100);
	// }
	if (chip_id != 0x60){
		_message.statusPrintf("BME280 Read Chip ID fail! \n");
		return false;
	}
	
	dig_T1 = BME280Read16LE(BME280_REG_DIG_T1);
	dig_T2 = BME280ReadS16LE(BME280_REG_DIG_T2);
	dig_T3 = BME280ReadS16LE(BME280_REG_DIG_T3);
	
	dig_P1 = BME280Read16LE(BME280_REG_DIG_P1);
	dig_P2 = BME280ReadS16LE(BME280_REG_DIG_P2);
	dig_P3 = BME280ReadS16LE(BME280_REG_DIG_P3);
	dig_P4 = BME280ReadS16LE(BME280_REG_DIG_P4);
	dig_P5 = BME280ReadS16LE(BME280_REG_DIG_P5);
	dig_P6 = BME280ReadS16LE(BME280_REG_DIG_P6);
	dig_P7 = BME280ReadS16LE(BME280_REG_DIG_P7);
	dig_P8 = BME280ReadS16LE(BME280_REG_DIG_P8);
	dig_P9 = BME280ReadS16LE(BME280_REG_DIG_P9);
	
	dig_H1 = BME280Read8(BME280_REG_DIG_H1);
	dig_H2 = BME280Read16LE(BME280_REG_DIG_H2);
	dig_H3 = BME280Read8(BME280_REG_DIG_H3);
	dig_H4 = (BME280Read8(BME280_REG_DIG_H4) << 4) | (0x0F & BME280Read8(BME280_REG_DIG_H4 + 1));
	dig_H5 = (BME280Read8(BME280_REG_DIG_H5 + 1) << 4) | (0x0F & BME280Read8(BME280_REG_DIG_H5) >> 4);
	dig_H6 = (int8_t)BME280Read8(BME280_REG_DIG_H6);
	
	BME280WriteRegister(BME280_REG_CTRLHUMID, 0x05);  //Choose 16X oversampling
	BME280WriteRegister(BME280_REG_CTRL, 0xB7);  //Choose 16X oversampling
	
	return true;
}

double Sensors::BME280GetTemperature(void) {
	int32_t var1, var2;

	int32_t adc_T = BME280Read24(BME280_REG_TEMPDATA);
	// Check if the last transport succeeded
	if (!isTransport_OK) {
		return 0;
	}
	adc_T >>= 4;
	var1 = (((adc_T >> 3) - ((int32_t)(dig_T1 << 1))) *	((int32_t)dig_T2)) >> 11;
	var2 = (((((adc_T >> 4) - ((int32_t)dig_T1)) * ((adc_T >> 4) - ((int32_t)dig_T1))) >> 12) * ((int32_t)dig_T3)) >> 14;
	t_fine = var1 + var2;
	double T = (t_fine * 5 + 128) >> 8;
	return T / 100;
}


double Sensors::BME280getBaro(void) {
  int64_t var1, var2, p;
  // Call getTemperature to get t_fine
  BME280GetTemperature();
  // Check if the last transport succeeded
  if (!isTransport_OK) {
	return 0;
  }
  int32_t adc_P = BME280Read24(BME280_REG_PRESSUREDATA);
  adc_P >>= 4;
  var1 = ((int64_t)t_fine) - 128000;
  var2 = var1 * var1 * (int64_t)dig_P6;
  var2 = var2 + ((var1 * (int64_t)dig_P5) << 17);
  var2 = var2 + (((int64_t)dig_P4) << 35);
  var1 = ((var1 * var1 * (int64_t)dig_P3) >> 8) + ((var1 * (int64_t)dig_P2) << 12);
  var1 = (((((int64_t)1) << 47) + var1)) * ((int64_t)dig_P1) >> 33;
  if (var1 == 0) {
	return 0; // avoid exception caused by division by zero
  }
  p = 1048576 - adc_P;
  p = (((p << 31) - var2) * 3125) / var1;
  var1 = (((int64_t)dig_P9) * (p >> 13) * (p >> 13)) >> 25;
  var2 = (((int64_t)dig_P8) * p) >> 19;
  p = ((p + var1 + var2) >> 8) + (((int64_t)dig_P7) << 4);
  return (double)(p / 256.0);
}

double Sensors::BME280GetHumidity(void) {
  int32_t v_x1_u32r, adc_H;
  // Call getTemperature to get t_fine	
  BME280GetTemperature();
  // Check if the last transport succeeded
  if (!isTransport_OK) {
	return 0;
  }
  adc_H = BME280Read16(BME280_REG_HUMIDITYDATA);
  v_x1_u32r = (t_fine - ((int32_t)76800));
  v_x1_u32r = (((((adc_H << 14) - (((int32_t)dig_H4) << 20) - (((int32_t)dig_H5) * v_x1_u32r)) + ((int32_t)16384)) >> 15) * (((((((v_x1_u32r * ((int32_t)dig_H6)) >> 10) * (((v_x1_u32r * ((int32_t)dig_H3)) >> 11) + ((int32_t)32768))) >> 10) + ((int32_t)2097152)) * ((int32_t)dig_H2) + 8192) >> 14));
  v_x1_u32r = (v_x1_u32r - (((((v_x1_u32r >> 15) * (v_x1_u32r >> 15)) >> 7) * ((int32_t)dig_H1)) >> 4));
  v_x1_u32r = (v_x1_u32r < 0 ? 0 : v_x1_u32r);
  v_x1_u32r = (v_x1_u32r > 419430400 ? 419430400 : v_x1_u32r);
  v_x1_u32r = v_x1_u32r >> 12;
  double h = v_x1_u32r / 1024.0;
  return h;
}


uint8_t Sensors::BME280Read8(uint8_t reg) {
	
	Wire.beginTransmission(BME280_I2C_ADDR);
	Wire.write(reg);
	Wire.endTransmission();

	Wire.requestFrom(BME280_I2C_ADDR, 1);
	// return 0 if slave didn't response
	if (Wire.available() < 1) {
		isTransport_OK = false;
		return 0;
	} else {
		isTransport_OK = true;
	}

