DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	return Wire.read();
}


uint16_t Sensors::BME280Read16(uint8_t reg) {
	uint8_t msb, lsb;

	Wire.beginTransmission(BME280_I2C_ADDR);
	Wire.write(reg);
	Wire.endTransmission();

	Wire.requestFrom(BME280_I2C_ADDR, 2);
	// return 0 if slave didn't response
	if (Wire.available() < 2) {
		isTransport_OK = false;
		return 0;
	} else {
		isTransport_OK = true;
	}
	msb = Wire.read();
	lsb = Wire.read();

	return (uint16_t) msb << 8 | lsb;
}


uint16_t Sensors::BME280Read16LE(uint8_t reg) {
	uint16_t data = BME280Read16(reg);
	return (data >> 8) | (data << 8);
}

int16_t Sensors::BME280ReadS16(uint8_t reg) {
	return (int16_t)BME280Read16(reg);
}

int16_t Sensors::BME280ReadS16LE(uint8_t reg) {
	return (int16_t)BME280Read16LE(reg);
}

uint32_t Sensors::BME280Read24(uint8_t reg) {
	
	Messages _message;
	
	uint32_t data;

	Wire.beginTransmission(BME280_I2C_ADDR);
	Wire.write(reg);
	Wire.endTransmission();

	Wire.requestFrom(BME280_I2C_ADDR, 3);
	// return 0 if slave didn't respond
	// if (Wire.available() < 3) {
	// 	isTransport_OK = false;
	// 	return 0;
	// } else if (isTransport_OK == false) {
	// 	isTransport_OK = true;
	// 	if (!BME280init()) {
	// 		_message.statusPrintf("BME280 device not connected or broken! \n");
	// 	}
	// }
	data = Wire.read();
	data <<= 8;
	data |= Wire.read();
	data <<= 8;
	data |= Wire.read();

	return data;
}

void Sensors::BME280WriteRegister(uint8_t reg, uint8_t val) {
	Wire.beginTransmission(BME280_I2C_ADDR); // start transmission to device
	Wire.write(reg);       // send register address
	Wire.write(val);         // send value to write
	Wire.endTransmission();     // end transmission
}

*/
